# Введення кількості предметів
n = int(input("введіть кількість предметів: "))
# Вводимо змінну для накопичення суми оцінок
total_sum = 0
# Створюємо цикл для введення n оцінок
for i in range(n):
    grade = float(input(f"Введіть оцінку {i + 1}: "))
# Накопичення суми
    total_sum += grade
# Рахування середньої оцінки
if n > 0:
    average = total_sum / n
# Виведення результату з форматуванням до двох знаків після коми
    print(f"{average: .2f}")
else:
    print("Кількість предметів має бути більше за 0")

