# Загадати число (наприклад, 7).
# Попросити гравця ввести свій варіант.
# Перевірити введене число за допомогою if/else:
# Якщо вгадав 7 — вивести: Перемога! Ти вгадав!.
# Якщо ввів менше 7 — вивести: Спробуй більше!.
# Якщо ввів більше 7 — вивести: Спробуй менше!.
# Загорнути процес у цикл while, щоб запитувати варіант доти, доки гравець не вгадає число.
import random
number = random.randint(1, 4)
sproby = 10
count = 0

while count <= sproby:
    count += 1
    n = int(input("Введіть свій варіант та вгадай число: "))
    if n > number:
        print(f"Спробуй менше!")
    elif n < number:
        print(f"Спробуй більше")
    else:
        print(f"Перемога! Ти вгадав. Кількість спроб {count}")
        break

print("Кількість спроб вичерпано! Йди додому!")



