# Взяти код перевірки ціни зі знижкою (з минулого домашнього завдання).
# Загорнути цю логіку у функцію checkPrice(price).
# Викликати цю функцію кілька разів поспіль із різними значеннями (наприклад: checkPrice(100), checkPrice(800), checkPrice(1200)).
# Переконатися, що функція правильно виводить результат для кожного випадку без дублювання коду.


def check_price(price):

    if price > 500:
        print(f"Ціна {price} грн - Дорого (потрібна знижка!)")
    else:
        print(f"Ціна {price} грн - Чудова ціна!")


# 1. Виклик функції для перевірки
print("Тестова перевірка")
check_price(100)
check_price(800)
check_price(1200)


# 2. Обробка списку цін через цикл
print("\nПеревірка списку цін")
numbers = [120, 480, 845, 500, 1250, 380, 1800]
for n in numbers:
    check_price(n)


