# 1. Створити функцію analyze_grades(grades)
# Функція приймає один параметр — список чисел (оцінок).

# 2. Всередині функції зробити наступне:
# Перебрати кожен елемент списку за допомогою циклу for:
# Якщо оцінка 4 або 5 — вивести в консоль: Оцінка [X] — Чудово!
# Якщо оцінка 3 — вивести в консоль: Оцінка 3 — Задовільно
# Якщо оцінка 1 або 2 — вивести в консоль: Оцінка [X] — Борг!

# Обчислити середній бал:
# Порахувати суму всіх оцінок і поділити на їхню кількість (sum(grades) / len(grades)).

# Вивести підсумок у консоль (умова if / else):
# Вивести рядок з середнім балом.
# Якщо середній бал 4.0 або вище — вивести: Вердикт: Стипендію призначено!
# Якщо середній бал менше 4.0 — вивести: Вердикт: Стипендії немає, треба підтягнути навчання.

# 3. Викликати функцію для двох студентів:
# Просто викликати функцію, передавши в неї список (без збереження у змінні):
# analyze_grades([5, 4, 5, 5, 4])
# analyze_grades([3, 2, 4, 3, 4])

def analize_grades(grades):
    for grade in grades:
        if grade >= 4:
            print(f"Оцінка {grade} - Чудово!")
        elif grade == 3:
            print(f"Оцінка {grade} - Задовільно!")
        else:
            print(f"Оцінка {grade} - Борг!")
grades1 = [4, 4, 5, 3, 5, 5, 5, 4]
analize_grades(grades1)
grades2 = [3, 3, 2, 4, 3, 3, 3, 4]
analize_grades(grades2)


def analize_gpa(grades):
    for grade in grades:
        gpa = sum(grades) / len(grades)
    if gpa >= 4:
        print(f"Стипендію призначено!")
    else:
        print(f"Стипендії немає! Треба підтягнути навчання.")

analize_gpa(grades1)
analize_gpa(grades2)


