# Взяти код перевірки ціни зі знижкою (з минулого домашнього завдання).
# Загорнути цю логіку у функцію checkPrice(price).
# Викликати цю функцію кілька разів поспіль із різними значеннями (наприклад: checkPrice(100), checkPrice(800), checkPrice(1200)).
# Переконатися, що функція правильно виводить результат для кожного випадку без дублювання коду.

# numbers = [120, 480, 845, 500, 1250, 380, 1800]
# for n in numbers:
#   if n > 500:
#        print(f"Ціна {n} грн - Дорого (потрібна знижка!)")
#    else:
#       print(f"Ціна {n} грн - Чудова ціна!")

def check_price(price):
    if price > 500:
        print(f"Ціна {price} грн - Дорого (потрібна знижка!)")
    else:
        print(f"Ціна {price} грн - Чудова ціна!")

numbers = [120, 480, 845, 500, 1250, 380, 1800]
for n in numbers:
    check_price(n)








