n = int(input("Введіть значення n: "))
# Зовнішній цикл визначає, з якого числа починається поточний рядок
for i in range(1, n + 1):
    # Внутрішній цикл генерує числа для поточного рядка від i до n включно
    for j in range(i, n + 1):
        # Друкуємо числа в лінію від i до n включно
        # end=" " змушує комп'ютер ставити пробіл замість переносу, щоб числа виводилися в один рядок
        print(j, end=" ")
    # Порожній print робить перенос рядка, готуючи місце для наступного кроку
    print()
